V1/Data/linkerd/240-5-wrk2-x8lmq.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 16.932ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 17.210ms, rate sampling interval: 55ms
  Thread calibration: mean lat.: 24.262ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 16.897ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 16.745ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 16.289ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 16.669ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 24.811ms, rate sampling interval: 57ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.67ms   15.54ms 138.88ms   93.54%
    Req/Sec    10.01     46.72   446.00     94.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.90ms
 75.000%   22.94ms
 90.000%   29.87ms
 99.000%   92.61ms
 99.900%  124.35ms
 99.990%  137.98ms
 99.999%  139.01ms
100.000%  139.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.071     0.000000            1         1.00
      10.463     0.100000         2307         1.11
      11.367     0.200000         4633         1.25
      12.303     0.300000         6932         1.43
      13.855     0.400000         9236         1.67
      16.895     0.500000        11542         2.00
      18.351     0.550000        12704         2.22
      19.615     0.600000        13846         2.50
      20.783     0.650000        15006         2.86
      21.823     0.700000        16167         3.33
      22.943     0.750000        17312         4.00
      23.599     0.775000        17890         4.44
      24.495     0.800000        18459         5.00
      25.663     0.825000        19036         5.71
      26.879     0.850000        19612         6.67
      28.255     0.875000        20191         8.00
      28.943     0.887500        20476         8.89
      29.871     0.900000        20763        10.00
      30.991     0.912500        21052        11.43
      32.927     0.925000        21338        13.33
      37.535     0.937500        21628        16.00
      43.455     0.943750        21771        17.78
      50.495     0.950000        21916        20.00
      55.295     0.956250        22061        22.86
      63.519     0.962500        22203        26.67
      71.999     0.968750        22348        32.00
      76.415     0.971875        22420        35.56
      79.295     0.975000        22493        40.00
      82.047     0.978125        22565        45.71
      85.631     0.981250        22636        53.33
      88.703     0.984375        22710        64.00
      89.983     0.985938        22745        71.11
      90.751     0.987500        22780        80.00
      91.647     0.989062        22817        91.43
      94.207     0.990625        22852       106.67
      95.807     0.992188        22888       128.00
      96.639     0.992969        22907       142.22
      97.471     0.993750        22924       160.00
      98.239     0.994531        22943       182.86
      99.135     0.995313        22963       213.33
     101.503     0.996094        22981       256.00
     102.911     0.996484        22987       284.44
     104.703     0.996875        22996       320.00
     107.775     0.997266        23005       365.71
     112.127     0.997656        23014       426.67
     113.919     0.998047        23023       512.00
     116.671     0.998242        23028       568.89
     118.911     0.998437        23032       640.00
     120.895     0.998633        23037       731.43
     122.239     0.998828        23041       853.33
     124.351     0.999023        23046      1024.00
     124.991     0.999121        23048      1137.78
     126.015     0.999219        23050      1280.00
     128.383     0.999316        23053      1462.86
     129.023     0.999414        23055      1706.67
     132.607     0.999512        23057      2048.00
     132.735     0.999561        23058      2275.56
     133.631     0.999609        23059      2560.00
     135.423     0.999658        23061      2925.71
     136.575     0.999707        23062      3413.33
     136.703     0.999756        23063      4096.00
     136.703     0.999780        23063      4551.11
     137.087     0.999805        23064      5120.00
     137.855     0.999829        23065      5851.43
     137.855     0.999854        23065      6826.67
     137.983     0.999878        23067      8192.00
     137.983     0.999890        23067      9102.22
     137.983     0.999902        23067     10240.00
     137.983     0.999915        23067     11702.86
     137.983     0.999927        23067     13653.33
     137.983     0.999939        23067     16384.00
     137.983     0.999945        23067     18204.44
     137.983     0.999951        23067     20480.00
     139.007     0.999957        23068     23405.71
     139.007     1.000000        23068          inf
#[Mean    =       20.675, StdDeviation   =       15.538]
#[Max     =      138.880, Total count    =        23068]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24006 requests in 5.00m, 8.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 6000
Requests/sec:     79.98
Transfer/sec:     30.23KB