V1/Data/linkerd/60-1-wrk2-bwj78.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 69.186ms, rate sampling interval: 236ms
  Thread calibration: mean lat.: 63.567ms, rate sampling interval: 230ms
  Thread calibration: mean lat.: 62.105ms, rate sampling interval: 233ms
  Thread calibration: mean lat.: 63.453ms, rate sampling interval: 202ms
  Thread calibration: mean lat.: 54.057ms, rate sampling interval: 193ms
  Thread calibration: mean lat.: 66.116ms, rate sampling interval: 240ms
  Thread calibration: mean lat.: 70.593ms, rate sampling interval: 241ms
  Thread calibration: mean lat.: 63.914ms, rate sampling interval: 248ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.44ms   35.95ms 443.65ms   95.70%
    Req/Sec     2.44     14.38   130.00     96.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.29ms
 75.000%   43.39ms
 90.000%   56.70ms
 99.000%  126.33ms
 99.900%  432.13ms
 99.990%  443.14ms
 99.999%  443.90ms
100.000%  443.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.399     0.000000            1         1.00
      24.159     0.100000          570         1.11
      27.391     0.200000         1135         1.25
      30.207     0.300000         1704         1.43
      32.623     0.400000         2270         1.67
      35.295     0.500000         2840         2.00
      36.671     0.550000         3124         2.22
      38.047     0.600000         3412         2.50
      39.519     0.650000         3690         2.86
      41.183     0.700000         3975         3.33
      43.391     0.750000         4256         4.00
      44.799     0.775000         4398         4.44
      46.527     0.800000         4541         5.00
      47.935     0.825000         4687         5.71
      49.823     0.850000         4823         6.67
      52.383     0.875000         4965         8.00
      54.527     0.887500         5036         8.89
      56.703     0.900000         5107        10.00
      58.911     0.912500         5178        11.43
      61.855     0.925000         5249        13.33
      66.047     0.937500         5320        16.00
      68.735     0.943750         5356        17.78
      72.127     0.950000         5391        20.00
      76.735     0.956250         5426        22.86
      83.071     0.962500         5462        26.67
      90.815     0.968750         5497        32.00
      95.615     0.971875         5516        35.56
      98.879     0.975000         5533        40.00
     101.567     0.978125         5550        45.71
     105.983     0.981250         5568        53.33
     112.447     0.984375         5587        64.00
     116.031     0.985938         5595        71.11
     120.063     0.987500         5604        80.00
     124.479     0.989062         5612        91.43
     127.679     0.990625         5621       106.67
     140.927     0.992188         5630       128.00
     382.207     0.992969         5635       142.22
     388.095     0.993750         5639       160.00
     396.031     0.994531         5643       182.86
     405.247     0.995313         5648       213.33
     406.783     0.996094         5652       256.00
     416.767     0.996484         5656       284.44
     417.023     0.996875         5657       320.00
     421.887     0.997266         5659       365.71
     423.679     0.997656         5661       426.67
     427.775     0.998047         5664       512.00
     428.031     0.998242         5665       568.89
     429.823     0.998437         5666       640.00
     431.359     0.998633         5667       731.43
     432.127     0.998828         5668       853.33
     436.223     0.999023         5669      1024.00
     438.015     0.999121         5670      1137.78
     438.015     0.999219         5670      1280.00
     442.111     0.999316         5671      1462.86
     442.111     0.999414         5671      1706.67
     442.623     0.999512         5672      2048.00
     442.623     0.999561         5672      2275.56
     442.623     0.999609         5672      2560.00
     443.135     0.999658         5673      2925.71
     443.135     0.999707         5673      3413.33
     443.135     0.999756         5673      4096.00
     443.135     0.999780         5673      4551.11
     443.135     0.999805         5673      5120.00
     443.903     0.999829         5674      5851.43
     443.903     1.000000         5674          inf
#[Mean    =       41.442, StdDeviation   =       35.952]
#[Max     =      443.648, Total count    =         5674]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6008 requests in 5.00m, 2.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.02
Transfer/sec:      7.57KB