V1/Data/linkerd/60-4-wrk2-q4vsj.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 23.015ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 23.898ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 22.388ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 22.973ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 21.969ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 23.222ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 23.015ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 23.713ms, rate sampling interval: 72ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.26ms   31.15ms 245.12ms   90.04%
    Req/Sec     2.44     19.78   269.00     98.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.14ms
 75.000%   25.09ms
 90.000%   58.81ms
 99.000%  170.75ms
 99.900%  236.29ms
 99.990%  245.25ms
 99.999%  245.25ms
100.000%  245.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.855     0.000000            1         1.00
      11.975     0.100000          567         1.11
      13.263     0.200000         1131         1.25
      14.535     0.300000         1694         1.43
      16.239     0.400000         2255         1.67
      18.143     0.500000         2820         2.00
      19.199     0.550000         3099         2.22
      20.431     0.600000         3385         2.50
      21.887     0.650000         3665         2.86
      23.343     0.700000         3947         3.33
      25.087     0.750000         4226         4.00
      26.383     0.775000         4368         4.44
      28.079     0.800000         4506         5.00
      30.095     0.825000         4648         5.71
      33.599     0.850000         4789         6.67
      43.295     0.875000         4928         8.00
      50.719     0.887500         5000         8.89
      58.815     0.900000         5069        10.00
      71.039     0.912500         5140        11.43
      78.527     0.925000         5210        13.33
      86.847     0.937500         5281        16.00
      90.367     0.943750         5316        17.78
      93.823     0.950000         5351        20.00
      98.687     0.956250         5386        22.86
     105.023     0.962500         5421        26.67
     119.103     0.968750         5456        32.00
     124.799     0.971875         5474        35.56
     130.175     0.975000         5492        40.00
     136.831     0.978125         5509        45.71
     142.975     0.981250         5528        53.33
     147.583     0.984375         5544        64.00
     149.887     0.985938         5553        71.11
     155.263     0.987500         5562        80.00
     164.863     0.989062         5571        91.43
     176.767     0.990625         5580       106.67
     188.287     0.992188         5588       128.00
     195.839     0.992969         5593       142.22
     199.935     0.993750         5597       160.00
     204.415     0.994531         5602       182.86
     209.535     0.995313         5606       213.33
     219.263     0.996094         5610       256.00
     223.615     0.996484         5614       284.44
     223.999     0.996875         5615       320.00
     228.735     0.997266         5617       365.71
     230.271     0.997656         5619       426.67
     232.447     0.998047         5621       512.00
     233.343     0.998242         5623       568.89
     234.879     0.998437         5624       640.00
     236.159     0.998633         5625       731.43
     236.287     0.998828         5626       853.33
     238.719     0.999023         5627      1024.00
     239.743     0.999121         5628      1137.78
     239.743     0.999219         5628      1280.00
     241.279     0.999316         5629      1462.86
     241.279     0.999414         5629      1706.67
     241.407     0.999512         5630      2048.00
     241.407     0.999561         5630      2275.56
     241.407     0.999609         5630      2560.00
     245.247     0.999658         5632      2925.71
     245.247     1.000000         5632          inf
#[Mean    =       28.260, StdDeviation   =       31.147]
#[Max     =      245.120, Total count    =         5632]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6008 requests in 5.00m, 2.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.03
Transfer/sec:      7.57KB